# CLI Tools
brew "git"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "htop"
brew "lazygit"
brew "jq"
brew "gh"
brew "git-delta"
# brew "direnv"      # Optional: project-specific environment activation
brew "zoxide"
brew "eza"
brew "fd"
brew "stow"
# brew "tailscale"   # Optional: secure mesh VPN
brew "todo-txt"
brew "hf"           # Hugging Face Hub CLI
brew "colima"       # Linux VM for the planned Incus host
brew "shellcheck"
brew "shfmt"

# Optional tooling retained as documentation:
# brew "mas"          # Mac App Store command-line interface
# brew "dockutil"     # Deterministic Dock layout management
# brew "mise"         # Alternative runtime manager; nvm is active here

# Languages n stuff
brew "python"
brew "pipx"
brew "nvm"
brew "antidote"

# GNU Utilities
brew "coreutils"
brew "gnu-sed"
brew "findutils"
brew "gawk"

# GUI Applications
cask "marta"
cask "zed"
cask "ghostty"
cask "discord"

# Optional applications retained as documentation:
# cask "visual-studio-code" # Zed is the active editor
# cask "obsidian"

# Terax currently has no official Homebrew cask. Install its signed macOS DMG
# from https://terax.app/ until an official cask becomes available.

# Fonts
cask "font-jetbrains-mono-nerd-font"
